## Merge And Concat

In [1]:
import pandas as pd

In [3]:
var1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
var2 = pd.DataFrame({'A': [10, 20, 30], 'D': [40, 50, 60], 'E': [70, 80, 90]})

In [8]:
var3 = pd.merge(var2,var1,on="A") # inner join on column A 
var3

Empty DataFrame
Columns: [A, D, E, B, C]
Index: []

In [9]:
var3

Empty DataFrame
Columns: [A, D, E, B, C]
Index: []

In [11]:
pd.merge(var1,var2,on='A',how="outer") # outer join on column A

    A    B    C     D     E
0   1  4.0  7.0   NaN   NaN
1   2  5.0  8.0   NaN   NaN
2   3  6.0  9.0   NaN   NaN
3  10  NaN  NaN  40.0  70.0
4  20  NaN  NaN  50.0  80.0
5  30  NaN  NaN  60.0  90.0

In [ ]:
pd.merge(var1,var2,on='A',how="inner") # inner join on column A

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [13]:
var4 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
var5 = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60]})
pd.merge(var4,var5,left_index=True,right_index=True) # inner join on index

   A_x  B_x  A_y  B_y
0    1    4   10   40
1    2    5   20   50
2    3    6   30   60

In [14]:
pd.concat([var4,var5])

    A   B
0   1   4
1   2   5
2   3   6
0  10  40
1  20  50
2  30  60

In [15]:
pd.concat([var4,var5] , axis=1) # concat on columns

   A  B   A   B
0  1  4  10  40
1  2  5  20  50
2  3  6  30  60